app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("detail", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["detail", ""], ["created_at", "2022-09-23 16:39:43.648951"], ["updated_at", "2022-09-23 16:39:43.648951"]]

    def set_reservation
      @reservation = Reservation.find(params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]